{"_id":{"$oid":"56f9f7ccd65e6ba60fe5bf55"},"artist":"Chance The Rapper","title":"Good Ass Intro","text":"Some people just know how to make an entrance. \"Good Ass Intro,\" a cut from Chicago rhymer Chance the Rapper's forthcoming Acid Rap, sounds like a star-maker, a reputation-cementer; \"good-ass\" just isn't the half of it. The track, produced by Stefan Ponce and Peter Cottontale with a vocal assist from BJ the Chicago Kid, slides effortlessly from loose, gospelly chords to the unmistakable clatter of footwork, like a Busby Berkley routine you can juke to. A lesser rapper might get lost in the fracas, but Chance easily outshines it all. You'll find traces of million-mixtape-era Wayne and Danny Brown's recent run in Chance's croaky delivery and rapid-fire flow, but what the three really share is the joy they seem to get out of rapping. Chance just dances across the track, rapping so hard by the end of his first verse, you'll half expect to hear the thud as he passes out on the studio floor. \"Raps just make me anxious, and acid made me crazy,\" he says at the top of the track, and it's that very combination of nervy energy and bugged-out wildness that makes \"Intro\" so very good-ass.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/90243750","backgroundsrc":"https://i1.sndcdn.com/artworks-000046904102-0iwr24-large.jpg"}
{"_id":{"$oid":"56f9fb30d65e6ba60fe5bf56"},"artist":"Anderson .Paak","title":"The Season/Carry Me","text":"It doesn’t take long to reach the heart of Anderson .Paak’s new album, Malibu. Just a minute into opening track \"The Birds,\" the West Coast-based rapper and singer/songwriter offers: \"My mama caught the gambling bug... My papa was behind them bars/ We never had to want for nuthin’/ Said all we ever need is love.\" His voice is warm, strained, and conversational, like a Baptist minister or your favorite uncle schooling you, and the wide-open groove has an unhurried feel. It's immediately clear: This is a sincere, soulful project, brimming with honesty and humble perseverance.\rBrandon Anderson Paak has seen a lot in his 29 years. His mother was a farmer from South Korea, and his father served in the Air Force and later worked as a mechanic until he was sent to prison. \"I didn’t see him again until he was being buried,\" .Paak told Consequence of Sound in a 2015 interview. All of this life experience is reflected in Malibu, which is both his most assured and most personal project yet.\r.Paak's name is more prominent these days given his recent work on Dr. Dre’s Compton, where he appeared on six of 16 tracks, but even his sophomore album, 2014's Venice, showed flashes of brilliance. Venice was an easy listen; on Malibu, .Paak celebrates his progression by acknowledging where he’s come from, the trials he’s endured and things he’s seen. \"I spent years being called out my name, living under my greatness,\" .Paak asserts on \"The Season / Carry Me,\" a shape-shifting album highlight. He grew up performing in church, and on the song’s second half, you can hear a rich gospel flair in his voice: \"Ya moms in prison, ya father need a new kidney/ Ya family’s splittin’, rivalries between siblings/ If cash ain’t king, it’s damn sure the incentive.\" Much like Kendrick Lamar, .Paak skillfully depicts his surroundings while remaining in the foreground.\r","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/232006248","backgroundsrc":"https://s3.amazonaws.com/hiphopdx-production/2016/01/anderson-.paak-malibu-cover-art.jpg"}
{"_id":{"$oid":"56f9ff65d65e6ba60fe5bf57"},"artist":"A$AP Rocky","title":"Brand New Guy","text":"A$AP Rocky channels his inner trap rapper for the new cut Brand New Guy. For assistance Rocky recruited West Coast rhymesayer Schoolboy Q and the pair spit classic down south-like lyrics to perfection. Production, crafted by in house producer Lyle, comes complete with all the bells, strings, 808s, and successive hi-hats that come standard with recent Southern sounds. I’m thinking that everyone from Cali to Houston to NYC will be the pleased with this stand out joint from Rocky’s LiveLoveA$AP mixtape released digitally last October. Fans of versatility will also be pleased to know that Rocky co-directed this video alongside The ICU. This is not the first visual effort that we’ve seen from the A$AP Mob general and it’s safe to say it won’t be the last. Stay right here in The Booth for more from Rocky and the rest of A$AP Mob.\r\nHowever it's the manner in which texture is used that separates post-Drake R\u0026B from the genre's past. Instead of pristine, sexual and sartorial, 'Pilot Jones's production is impressionist, smudged and blanketing. Which is to say, texture is used as a story-telling device in itself, a kind of visual aid, rather than a mere mood setter.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/27540010","backgroundsrc":"https://i1.sndcdn.com/artworks-000013770750-ho48d2-large.jpg"}
{"_id":{"$oid":"56fa7eebd65e6ba60fe5bf58"},"artist":"Vic Mensa","title":"Orange Soda","text":"If you ask anyone who grew up in the 90’s, “who loves Orange Soda?”, you should expect an immediate and emphatic “Kel loves orange soda.” (If they don’t know, you might want to check their birth certificate, because they just might be lying.) Perhaps those born after the Keenan \u0026 Kel Era will now equate Orange Soda with Vic Mensa, as his latest visual offering is quite the homage to the popular beverage. While this is the Chicago native’s first solo feature, Mensa is no stranger to the Booth; he was the frontman for Booth favorite Kids These Days (sadly, they broke up) and has appeared as a guest of both Alex Wiley and fellow Savemoney-er Chance The Rapper.  It shouldn’t come as a surprise, though, because it’s clear Mensa has been behind a mic before. Over a laid-back, snared-out beat from producer Cam, and in between hits from an orange soda filled bong, Vic demonstrates a charismatic, fluid flow and some seriously impressive wordplay. Orange Soda is the second single off Vic’s forthcoming solo project, INNANETAPE.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/113270754","backgroundsrc":"https://i1.sndcdn.com/avatars-000244801271-9657jc-t500x500.jpg"}
{"_id":{"$oid":"56fa829fd65e6ba60fe5bf59"},"artist":"Kendrick Lamar","title":"Rigamortis","text":"Compton, CA rapper Kendrick Lamar‘s stock is on the rise. Along with a Windows-sponsored track in “Cloud 10” and a remix of Foster The People’s “Pumped Up Kicks”, the MC will also join Drake and ASAP Rocky on tour after hitting up the CMJ Music Marathon later this month. All that in addition to his highly-lauded Section.80 mixtape from earlier this year, and we think it’s safe to say the kid’s got star potential. It’s that very charisma that’s on display in the video for “Rigamortis”. In simple settings like an art gallery or on the city streets fronting a jazz trio, Lamar spits his verses over the simple horn loop like a machine gun, all with a detached yet whole captivating presence to him. And he’s a nice guy to boot, giving his fallen enemies their last rites. Your favorite rapper is dead. Amen.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/34508773","backgroundsrc":"https://i1.sndcdn.com/artworks-000017320669-cln59u-large.jpg"}
{"_id":{"$oid":"57ada51f7e0b761897d6143f"},"artist":"Isaiah Rashad","title":"Free Lunch","text":"For those familiar with Isaiah Rashad’s head-turning Cilvia Demo EP, “Free Lunch” won’t dodge expectations. The 25-year-old Tennessee native carved out his own lane on TDE’s superstar lineup (Kendrick, Schoolboy Q) by doubling-down on his idiosyncratic style of hazy, heavy-lidded rap. But as familiar as it may be to find Rashad’s drawl surrounded by drifting soul keys and blunted samples, it doesn't stop “Free Lunch” from being his most refined performance yet.  “Free Lunch”’s call to accumulate meal tickets acts as an anchor for Rashad's stream-of-consciousness lyrics. The track evokes images of a summer spent baking in the Southern sun, chasing money and women, reconnecting with kinfolk, and staying as “clean as Tide” by any means. A less capable rapper would get lost in the track’s chill, but with his ability to wear and shed nimble flows at will, Rashad never loses momentum. Even at his most relaxed and spacious, the MC never sounds laconic.   Rashad’s already proven he’s a worthy Southern ambassador to the Top Dawg label with Cilvia, but here, it seems he’s setting his eyes on a loftier goal (like the world domination of his Southern rap forebears, OutKast and UGK). “Feel this one out in California,” Rashad raps, and with a vibe like this, it’s hard to believe they wouldn’t.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/277302718","backgroundsrc":"https://i1.sndcdn.com/artworks-000175338635-yfzzpd-large.jpg"}
{"_id":{"$oid":"57ada5377e0b761897d61440"},"artist":"Swet Shop Boys","title":"T5","text":"There are few places in the world that test the patience of people of color more than airport security. It’s a tense zone where racism is allowed to go pretty much unchecked under the guise of national welfare; I have yet to meet a fellow brown person who doesn't have some horror story of at least mild abuse at the hands of the TSA. Add to the list Swet Shop Boys, aka ex-Das Racist rapper Heems and actor/musician Riz MC (who are of Indian and Pakistani descent, respectively). Their debut album, Cashmere, is out on their own Customs label later this year.  Opening with piercing shehnais and snuffling police dogs, the duo’s new single, “T5,” serves as a testament to the shifty unease of being selected for a “random search.” (It even uses a few sample lines from understated airline staffers: “Follow me please...”) Heems’ signature lackadaisical humor is front and center in his verse, referencing doctored visas and girls left in Palestine. “Always get a random check when I rock the stubble,” he spits, equally annoyed and dejected. Riz counters Heems’ stoner flow, taking on issues like Trump and Brexit with pinpoint precision. What could be a better foil to micro-aggressive profiling than quippy, multi-ethnic hip-hop?","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/276480981","backgroundsrc":"https://i1.sndcdn.com/artworks-000174502846-yfpx5k-large.jpg"}
{"_id":{"$oid":"57ada5467e0b761897d61441"},"artist":"Lisa/Liza","title":"Century Woods","text":"“Century Woods,” the opening track from Lisa/Liza’s upcoming debut album, sounds of another time. That is not to say it’s an anachronism. In fact, singer/songwriter Liza Victoria’s dreamy, psychedelic folk fits in well with 2016’s class of forward-thinking Cosmic Americana troubadours. So maybe it’s more apt to say that “Century Woods” exists outside of time entirely. Victoria opens the song in a drifting, half-existent time signature, her careful, close-mic’d guitar lapping gently like sleepy waves at high tide. Her vocals reverberate powerfully without an ounce of reverb. The song’s dry production—seemingly no overdubs or effects at all—actually makes it sound even more mysterious: the magic is entirely in her performance. Six minutes in, as the song’s jazzy, Karen-Dalton-on-ambien melody begins to settle into your brain, it just kind of ends. The last sentence is left unfinished, the chord progression unresolved. Victoria’s haunting, imagistic dream logic is only beginning to reveal itself.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/262171910","backgroundsrc":"https://i1.sndcdn.com/artworks-000170989165-2aavsy-large.jpg"}
{"_id":{"$oid":"57ada5577e0b761897d61442"},"artist":"Gaika","title":"3D","text":"London is the sixth most expensive city to live in the world, and it’s only getting worse. Gentrification, intense class stratification, oligarchic estates—they’re a part of London or any postmodern city where data and profit guide the shaping and policing of the streets. In Security, a mixtape the artist Gaika released earlier this year, he tackled these subjects with an anarchic attitude and grim sense of humor. In “3D,” Gaika returns to the crime scene and orbits around urban decay with an even more diverse and bracing sound.  He begins stating the problem of his music clearly: “This is my city and these are my streets/In a state of emergency.” His rapping is more malleable, moving from a snarl to vulnerability as he suggests that bodies, in his downtrodden city, are just “props to the jewels and the clocks.” The elasticity of Gaika’s voice is complimented by a dancehall beat that pulls freely from the plasticine pop of PC Music. Drums and hissing synths stretch like Saran Wrap over his voice, giving the whole song a fascinatingly cold and inhuman feeling. It strikes a strange balance between apocalyptic and joyous, a siren song for the end of the world under late capitalism.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/276622066","backgroundsrc":"https://i1.sndcdn.com/artworks-000174657259-suwmk2-large.jpg"}
{"_id":{"$oid":"57ada5647e0b761897d61443"},"artist":"Noname","title":"“Diddy Bop” [ft. Raury \u0026 Cam O’bi]","text":"Noname is the latest voice to emerge this year from the loose assemblage of artists gathered around Chance the Rapper, and her music shimmers with the evening-streetlight glow that characterizes most of them. Like Chance’s Coloring Book, or Jamila Woods’ HEAVN, or even Joey Purp’s rough but sternly humane iiiDrops, Noname’s music feels luminously positive, clear-eyed, and compassionate. “Diddy Bop” is luxurious and easy and warm, a reminiscence about good times, or better ones. Her voice is in a playful and confident middle range between forestalling, singing, and slam poetry, and her lyrics carve out enough details to fill the song with an entire imagined cast of characters—jealous boyfriends griping at girls in love with Raz-B from B2K; kids nabbing twenties from their mom’s purse.  Raury, a still-developing would-be eccentric clearly in thrall to the shadow of André 3000, murmurs his verse into the track’s ear; it’s one of his sweetest and most unforced performances ever. From the evidence of the music, there is something restorative and calming about just being around Chance’s crew. It breeds music that feels so sure of itself and its place in the world that it can’t help but be infectious.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/276248851","backgroundsrc":"https://i1.sndcdn.com/artworks-000174220212-0dohw9-large.jpg"}
{"_id":{"$oid":"57ada5957e0b761897d61444"},"artist":"D.R.A.M.","title":"Cute","text":"Of rap’s latest crop of potential pop crossovers, D.R.A.M. is the best equipped to tackle a song like “Cute.” Though he has a voice like a wrecking ball, and a smile nearly as large, D.R.A.M.’s most notable quality remains the total joy he weaves into each of his songs. Not unlike his best tracks—the “Hotline Bling”-inspiring “Cha Cha,” or his recent Billboard staple “Broccoli”—“Cute” channels pure euphoria into each line (and there are at least three or four strong hooks packed into this one song).  “Cute” is the classic sound of crushing hard for four minutes. “Even though it’s cliché,” D.R.A.M. sings coyly, “I saw you on your Instagram/And I think you’re cute.” The Charlie Heat-sourced instrumental velvety organs and Hemsworth-ian 8-bit synths set the vibe, while D.R.A.M.’s fluttering melodies are as endearing as ever. It’s hard not to smile as he declares, “I just had to park my car cause I was finna crash the whip/Scroll    through my feed Iaw you just had post a pic/I choose you like a Pokémon.” As rappers continue to stretch the 808s \u0026 Heartbreak aesthetic to its dour limits, D.R.A.M.’s “Trappy Go Lucky” tunes are a refreshing break. And for those of you curating summery “Found a New Bae” playlists, “Cute” will fit well between “I'm Sprung” and “My Boo.”","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/275866105","backgroundsrc":"https://i1.sndcdn.com/artworks-000173820165-702wkj-large.jpg"}
{"_id":{"$oid":"57ada59f7e0b761897d61445"},"artist":"Cam \u0026 China","title":"We Gon Make It","text":"Compared to the rest of their new self-titled EP, Cam \u0026 China’s “We Gon Make It” is low-key. The instrumentals for the six preceding tracks lurch aggressively, the perfect backdrop for the Inglewood twins’ relentless mean mugging. But the beat on the closer (produced by Seige Monstracity) glides behind them, setting the stage for a reflective track that serves as a mission statement for their musical and personal journeys. It’s still a Cam \u0026 China song, though, which means it’s tough and unforgiving. Their father gives them life advice, but that’s still “go and get it,” so they can “kill off” everyone in their way.  They rap menacingly about overcoming struggles, making “We Gon Make It” very inspirational. On their more thunderous songs, Cam \u0026 China create jolts of energy, transferring their strength to the listener, at least temporarily. More pensive here, they stir something sustainable: the feeling that anything is possible. Cam \u0026 China’s fierceness is palpable and contagious. “We Gon Make It” makes that power motivational.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/275390512","backgroundsrc":"https://i1.sndcdn.com/artworks-000173327586-s5h0xz-large.jpg"}
{"_id":{"$oid":"57ada5ac7e0b761897d61446"},"artist":"Yohuna","title":"The Moon Hangs in the Sky Like Nothing Hangs in the Sky","text":"Johanne Swanson, the New York-based songwriter who records as Yohuna, has said the awkward neologism that titles her debut album Patientness is intended as a bit of self-laceration. She sees the five years she took between her EP Revery and this release, and the quasi-nomadic path she’s tread across the globe in that time—she’s called Wisconsin, New Mexico, Berlin, and New York home in the last decade—as evidence of agitation, an unwillingness to slow down.  But her work tells a different story, particularly the slowly unfolding “The Moon Hangs in the Sky Like Nothing Hangs in the Sky.” Swanson leans on the gentle plod of a few intersecting keyboard lines and the continuous thunder of a distant rhythm, but she doesn’t sink into the stoned depression of forebears that operated at this languorous pace, like Slowdive or Codeine. The twilight weight of “The Moon” is more akin to the Microphones. Swanson acknowledges a mire of conflicted feelings in the song’s dizzy lyrics, but she uses her voice to hover somewhere above it all, unscathed and content. It’s the clear effort of someone who’s spent time meditating on such things—a reminder that good things come to those who are willing to wait.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/268958690","backgroundsrc":"https://i1.sndcdn.com/artworks-000167246256-4zcja9-large.jpg"}
{"_id":{"$oid":"57ada5bb7e0b761897d61447"},"artist":"PWR BTTM","title":"Projection","text":"With all the blustery guitar solos and glitter that make up a PWR BTTM live show, it’s easy to forget that some of the nascent New York band’s best songs are bummers. Their debut LP Ugly Cherries was full of low moments—love remains unrequited, general anhedonia abounds. Their new single, “Projection,” seemingly foregrounds the pain. The duo’s guitarist Ben Hopkins takes the lead here, outlining the way the world outside can bear down on you—likening the toll it takes to a sunburn. “My skin isn’t made for the weather,” they sing.  However much joy PWR BTTM espouse in their queer love stories, “Projection” acknowledges that even going outside can be hard when you present an identity apart from the straight cis white norm. But then, there’s a turn—a fuzzbomb amid the gloom, a joyful explosion of rapid-fire guitar licks that pops up in fits and starts throughout the track. It’s an instrumental rejoinder to the weight of the world that says: in spite of it all, happiness is still possible, somehow.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/268049983","backgroundsrc":"https://i1.sndcdn.com/artworks-000166414087-4599ah-large.jpg"}
{"_id":{"$oid":"57ada5d07e0b761897d61448"},"artist":"Jenny Hval","title":"Conceptual Romance","text":"Jenny Hval’s “Conceptual Romance” blooms in the space between two bodies colliding, that brief time in which there is the chance to recoil before erotic catastrophe. Flowing through Hval’s head—her “land mine of a heart”—are euphoric dissociations, uncertainty, and sacrifice; she calls this “abstract romanticism.” She confronts these problems from afar, as if it is possible to abandon the body in order to examine its existence. Whereas the beats on Apocalypse, girl and  “Female Vampire” are complex, shifting collages, the underlying texture on “Conceptual Romance” is steady and skittering. It’s a dependable lifeblood for Hval’s tranquil introspection.  “Conceptual Romance” evokes that distinct feeling of an artist aligning the stars of emotional reality so succinctly that the result becomes sacred. Anne Carson described this as “a fragrance of understanding—this smell in your head of having gone through something that you understood with the people in the story.” For me, this moment occurs when Hval calls in from a foreign realm: “I don’t know who I am, but I’m working on it/I’m high, high on madness/These are my combined failures/I understand infatuation, rejection/They can connect and become everything, everything that’s torn up in your life.” How does Hval so precisely encompass this tragic spell we all must confront at one point or another? Those who are familiar with Hval’s work know she can flawlessly handle the abstract. But she has never been more concrete, nor more open.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/274549436","backgroundsrc":"https://i1.sndcdn.com/artworks-000172350410-r3v3j0-large.jpg"}
{"_id":{"$oid":"57ada5df7e0b761897d61449"},"artist":"Moor Mother","title":"Georgia+Mass","text":"The genius of Camae Ayewa—musician, activist, organizer, curator, poet—has been percolating underground for the better part of a decade. As Moor Mother, the Philly-based artist has released some 100 recordings online since she began the project in 2012, masterfully reimagining the electronic noise collage as protest song. Ayewa makes beats, bashes punk chords, and raps, fusing these elements seamlessly with samples that have ranged from the late Maya Angelou reading her poem “A Brave and Startling Truth” to Fugazi’s “Waiting Room” bassline. Ayewa’s searing themes tie it together; her lyrics focus on systemic racism. “Malcolm X was my childhood hero,” Ayewa has said, and she has described the sound of Moor Mother as “blk girl blues,” “coffee shop riot gurl songs,” “project housing bop,” “anthropology of conscience,” “slaveship punk,” “death poems.”  The first Moor Mother LP, Fetish Bones, arrives in September, but the rhythms of “Georgia+Mass” are a fitting introduction. Ayewa says the eight-minute piece is about “investigating alternative methods of healing.” It rolls on like a deep meditation in gorgeous free jazz sax and cosmic textures, with a grounding om occasionally zipping in to rumble below the surface. Its joyful noise features samples from the gospel ensemble Georgia Mass Choir’s “Come in the Room” as well as of legends Alice Coltrane and Pharoah Sanders, plus 10 of her own tracks and a spoken clip about erasure. Ayewa’s music intends the opposite: “It has a lot to do with awakening memories,” she has said. You can hear history inside of it, building momentum, rolling into the future.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/272224820","backgroundsrc":"https://i1.sndcdn.com/artworks-000170148760-3p3i47-large.jpg"}
{"_id":{"$oid":"57ada5e87e0b761897d6144a"},"artist":"Mykki Blanco","title":"The Plug Won’t","text":"“High School Never Ends,” the first single off Mykki Blanco’s upcoming full-length Mykki, was a dispatch from a war. The track, hazy with drugs and ominous heat, premiered in tandem with a video that told the story of two lovers caught up in an ancient feud with bloody consequences.  “The Plug Won’t,” produced by longtime collaborator Jeremiah Meece (“She Gutta,” “SCALES”), feels like a companion, or perhaps a path to an alternate ending: mid-spiral, the narrator tries to come up for air and find reconciliation. Rapid-fire laser blasts are mixed over a measured low end boom, replicating the feeling of trying to take deep breaths even as your synapses are firing too fast to function. Mykki raps through a relationship flare-up, the back-and-forth of the bars mirroring the back-and-forth of a conflict: “One minute we so in it/Next minute you so offended/Can't believe I just defended all the bullshit you were spinning/I hold you special/Fuck is the issue/I don't see your best friend on the text agreeing with you?”  Beyoncé, Case/Lang/Veirs, and Karen O have all penned songs with some take on the line “they don’t love you like I love you,” but on “The Plug Won’t,” Mykki picks up the other perspective, trying to remind himself that the “plug,” “club,” and “drugs don’t love me like you.” It can feel trite to say that the people closest to us can hurt us the most, or that, even when it doesn't feel like it, those people are often there for us in a way that less tangible things are not. But as our dystopian hellworld heats up and the spreading toxicity has us turning on each other in seemingly irreconcilable ways, “The Plug Won’t” is a welcome reminder.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/274549249","backgroundsrc":"https://i1.sndcdn.com/artworks-000172350200-grrgmh-large.jpg"}
{"_id":{"$oid":"57ada5f37e0b761897d6144b"},"artist":"Warehouse","title":"Reservoir","text":"On “Reservoir,” Warehouse are fighting a losing battle against hopelessness. “I can tell we're heading towards the apex/Or the end/And either way/It will be fine,” sings Elaine Edenfeld, trying to put her fretful lover at peace. Here, the Atlanta band emerge as kin to Sheer Mag and Dilly Dally, roughing up the classics with whisky-ravaged throats and limited means. Comprising guitarists Alex Bailey and Ben Jackson, bassist Josh Hughes, and drummer Doug Bleichner, the band intertwine Television’s peacocking riffs with Chicago splashiness and their melodic Georgia roots, stretching and stalling the pace along with Edenfeld’s assurances and pleas: “I'll be here when loss confounds you/To gesture a way out/Picking up the pieces of your life/Don't ever fall behind/Just 'cause it's easier/Don't ever lose your place/Or throw it away.” Her dirty gargle switches between vulnerable tremors and pained frustration, and turns “Reservoir” into the rare song that you could shotgun a beer to and then use the can as a tear-catcher.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/271251562","backgroundsrc":"https://i1.sndcdn.com/artworks-000169314165-qxmvx8-large.jpg"}
{"_id":{"$oid":"57ada5ff7e0b761897d6144c"},"artist":"Thunder Tillman","title":"Exact Location of the Soul","text":"“A magic carpet ride with no dead weight” is how Thunder Tillman’s “life coach” introduced a truly border-blurring psychedelic set on Lot Radio from earlier this month. There’s not much to be known about newcomers Thunder Tillman, or if said life coach is in fact also a member, but their debut EP for Los Angeles’s ESP Institute is a bit of a departure for the label. Since 2010, the imprint has specialized in leftfield dance tracks from producers around the world, but Tillman’s sound has an openness and spontaneity to it that suggests less a track being tweaked in the studio and more a duo at play in the garage.  “Exact Location of the Soul” begins as a minimal droning track, but just as you become mesmerized by the gentle strums and buzzing organ, it bursts into Technicolor. A motorik beat, escalating melody, and wordless vocal sends the track skyward, bringing to mind the likes of La Düsseldorf and Stereolab. While there’s a strong pulse to “Soul,” the track retains a sense of daydreaming drift. Despite what Thunder Tillman’s name entails, it conjures nothing but glorious cumulus clouds in your head.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/274442908","backgroundsrc":"https://i1.sndcdn.com/artworks-000172236980-owdabd-large.jpg"}
{"_id":{"$oid":"57ada60d7e0b761897d6144d"},"artist":"Ultimate Painting","title":"Bills","text":"Dusk, the title of Ultimate Painting's third album, is a pretty good encapsulation of their sound. Like Yo La Tengo and American Analog Set before them, the London duo (comprising Mazes' Jack Cooper and Veronica Falls' James Hoare) intertwine steady guitar leads and Krautrock bass lines to hushed and twilit effect. It's the perfect cover for their brand of nonchalant evasion: On 2015's Green Lanes, Cooper missed an appointment at the job center and found himself placed under sanctions. On new single “Bills,” he's no longer even pretending to be interested in facing his responsibilities, hiding out in his darkened flat as the debts mount up and bailiffs pound the door. “I like to drink and like to sleep,” he whispers without a trace of apology, as “Bills” continues its sweet and idle bob. But then his frustration breaks through, rupturing the pace with a lyric that doesn't quite fit the meter: “I'm not good at being told what to do/It seems the older I get/The less I feel comfortable with it.” We're not exactly lacking for shaggy dropouts railing against the system, but “Bills” feels like an elegy for a band's ability to exist in a capital city, and for arrested development.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/273180881","backgroundsrc":"https://i1.sndcdn.com/artworks-000171008796-ijezsv-large.jpg"}
{"_id":{"$oid":"57ada6307e0b761897d6144e"},"artist":"Katie Dey","title":"Only to Trip and Fall Down Again","text":"Katie Dey’s music almost invariably lends itself to talk of How We Live On the Internet: it’s glitchy and distorted, overloaded with electronic information, and her last album title looked like a pocket text. The Melbourne artist creates immersive, swirling, multihued psychedelia that is not kaleidoscopic so much as it contains the tragic, mesmerizing beauty of a spiderwebbed iPhone cover. But regardless of the technology, all of these discussions deal in emotional disconnection, spiritual quandaries, and, of course, pop music itself.  Even if Dey's beguiling album Flood Network is intentionally hard to strip for individual parts, it is pop music. The disorienting presentation of highlight “Only to Trip and Fall Down Again” just ensures that it'll speak to those who prefer that their pop affirmation isn’t entirely purified; the EQ'ing gives her melodies a pleasing, unusual tartness that plays off the song’s plainspoken lyrics. Like so many other internet pursuits that appear blinkered and distracted on the surface—Reddit, Pokemon Go, you name it—“Only to Trip and Fall Down Again” is just seemingly insular people trying to find new ways to connect.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/263466608","backgroundsrc":"https://i1.sndcdn.com/artworks-000169619076-263gdn-large.jpg"}
{"_id":{"$oid":"57ada6447e0b761897d6144f"},"artist":"Mood Hut","title":"Better","text":"Vancouver’s Mood Hut isn’t just a label; it’s also a collective. The fact that the collective’s identity often supersedes that of its individual artists says something about the communal nature of the leftfield house scene that’s brewing up in the Pacific Northwest. Earlier this year, eight of the crew came together under the Mood Hut umbrella to release a collection of library music for the Japanese label Snaker. And on this year's Disco Mantras Vol. 1, the label's first long-player, they stuck to the collaborative ethos, adopting mystery aliases like Lion Heart and Dorjan Attamofd.  According to a note on the label’s SoundCloud page, the latest single, which is uncredited, dates back to the Love Dancing parties that Chris Wang and JLM (aka Bluntman Deejay) began throwing in 2009—“a formative dance experience for many of us in Vancouver,” they write, “and an essential ingredient in the Mood Hut stew.” You can tell from the sound of “Better” that they must have been pretty damned special. Disco breaks and a bright Rhodes loop throw off mirror-ball sparks; a bleepy synth lead adds to the heady, flushed-cheeks vibe. Just before the two-minute mark, there’s a moment of silence, and then bright, brassy horns kick into high gear. It’s hard to imagine a more jubilant kind of floor-filler, or a more innocent one, for that matter. It’s all smiles, the kind of elation you can only really feel in a room full of your closest friends and family.","source":"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/273507143","backgroundsrc":"https://i1.sndcdn.com/artworks-000171309130-k5cq56-large.jpg"}
